public/resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-14 Tue 22:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>esac-io's Resume</title>
<meta name="generator" content="Org mode">
<link href="css/site.css" rel="stylesheet">
<link href="https://esac-io.github.org" rel="canonical">
</head>
<body>
<div id="preamble" class="status">
<div class="nav">
  <input type="checkbox" id="show-menu" role="button">
  <label for="show-menu" class="show-menu f-right">Menu</label>
  <div id="menu">
    <ul class="f-left"><li>
        <a href="index.html" class="home active">Home</a></li><li>
        <a href="resume.html" class="blog">Resume</a></li><li>
        <a href="blog/index.html" class="blog">Blog</a></li><li>
        <a href="projects/index.html" class="code">Projects</a>
    </li></ul>
    <ul class="f-right"><li>
        <a href="https://github.com/esac-io" class="github">GitHub</a></li><li>
        <!-- <a href="" class="donate">Donate</a>  -->
    </li></ul>
  </div>
</div>
</div>
<div id="content">

<div id="outline-container-orgd522d8e" class="outline-2">
<h2 id="orgd522d8e">Isaac (esac-io)</h2>
<div class="outline-text-2" id="text-orgd522d8e">
<p>
Email | <a href="http://www.github.com/esac-io">Githut</a> | <a href="https://www.linkedin.com">Linkedin</a>
</p>
</div>
</div>

<div id="outline-container-org9ee60f3" class="outline-2">
<h2 id="org9ee60f3">▐ Bio</h2>
<div class="outline-text-2" id="text-org9ee60f3">
<p>
I'm an information technology professional
with a Bachelor's Degree in Computer Engineering.
The focus of my studies are: algorithms, data oriented
programming, software architecture, low level technologies
and mathematical concepts applied to computer science.
</p>
<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-org9438ee5" class="outline-2">
<h2 id="org9438ee5">▐ Experience</h2>
<div class="outline-text-2" id="text-org9438ee5">
</div>
<div id="outline-container-org2179023" class="outline-3">
<h3 id="org2179023">Computer Engineer: Loopce (2014 - 2018)</h3>
<div class="outline-text-3" id="text-org2179023">
</div>
<div id="outline-container-org763f495" class="outline-4">
<h4 id="org763f495">LOOPKEY</h4>
<div class="outline-text-4" id="text-org763f495">
<p>
The Loopkey is an embedded system, designed to be coupled to any eletronic lock
device, adding to him more functionality and security.
The mobile application(adroind/ios) is used to control the
loopkey(lock device). The communication is made using the bluetooth
protocol and the security of the channel is guaranteed by Speck
encryption algorithm.
</p>

<ul class="org-ul">
<li>Assignments:</li>
</ul>

<pre class="example">
- Researcher
- Software Architecture
- Firmware Programming
- Optimization
- Debugging
- Tests Programming
- Deployment
</pre>

<ul class="org-ul">
<li>Applied technologies:</li>
</ul>

<pre class="example">
- C
- Python
- OpenOCD
- Nodic SDK
- Bluetooth
- Speck (Cryptograph Algorithm)
</pre>
</div>
</div>

<div id="outline-container-orgb0740a2" class="outline-4">
<h4 id="orgb0740a2">CAVIT</h4>
<div class="outline-text-4" id="text-orgb0740a2">
<p>
The project aimed to inspect the dimensions
of credit cards (mainly the cavity reserved for the EMV chip)
through image processing algorithms. The input image
was captured by a high precision camera and its processing
resulted in metrics that could be further analyzed.
</p>

<ul class="org-ul">
<li><p>
Assignments:
</p>

<div class="org-src-container">
<pre class="src src-sh">- Software Architecture
- Full stack development
- Debugging
</pre>
</div></li>

<li>Applied technologies:</li>
</ul>
<pre class="example">
- C++
- Qt
- OpenCV
- Python
- Cmake
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b04321" class="outline-2">
<h2 id="org9b04321">▐ Education</h2>
<div class="outline-text-2" id="text-org9b04321">
</div>
<div id="outline-container-org99771d8" class="outline-3">
<h3 id="org99771d8">Bachelor's deegre (2011 - 2015)</h3>
<div class="outline-text-3" id="text-org99771d8">
<p>
Computer Engineering, UNB
</p>
</div>
</div>
<div id="outline-container-org802e954" class="outline-3">
<h3 id="org802e954">Courses</h3>
<div class="outline-text-3" id="text-org802e954">
</div>
<div id="outline-container-orgda3a131" class="outline-4">
<h4 id="orgda3a131">Nand2Tetris</h4>
</div>
</div>
<div id="outline-container-orge5cc8da" class="outline-3">
<h3 id="orge5cc8da">Books</h3>
</div>
</div>
<div id="outline-container-org932e2f1" class="outline-2">
<h2 id="org932e2f1">▐ Achievements</h2>
<div class="outline-text-2" id="text-org932e2f1">
</div>
<div id="outline-container-org4cbe73b" class="outline-3">
<h3 id="org4cbe73b">First place: Hackathon Civico Cotidiano, Cotidiano Aceleradora (2016)</h3>
<div class="outline-text-3" id="text-org4cbe73b">
<p>
The hackathon theme was the application of technology to
solve social problems, our team was the winner through the
creation of an android app (chegouSUS) which tells you when
the medicine is available in the single health system.
</p>
</div>
</div>

<div id="outline-container-orgd350992" class="outline-3">
<h3 id="orgd350992">Frist place: Cyber Security Challenge, Maxtera/Boeing (2014)</h3>
<div class="outline-text-3" id="text-orgd350992">
<p>
Our team solve a series of challenges related to information
security in order to gain access to diverse systems.
</p>
</div>
</div>
</div>

<div id="outline-container-org832de32" class="outline-2">
<h2 id="org832de32">▐ Lectures</h2>
<div class="outline-text-2" id="text-org832de32">
</div>
<div id="outline-container-org013a331" class="outline-3">
<h3 id="org013a331">Cryptorave: Fuzzing in pratice, finding software bugs (2014)</h3>
</div>
</div>
<div id="outline-container-org8fd13a2" class="outline-2">
<h2 id="org8fd13a2">▐ Languages</h2>
<div class="outline-text-2" id="text-org8fd13a2">
</div>
<div id="outline-container-org6ff53ca" class="outline-3">
<h3 id="org6ff53ca">English</h3>
<div class="outline-text-3" id="text-org6ff53ca">
<p>
Full professional proficiency
</p>
</div>
</div>
<div id="outline-container-org8b0df2d" class="outline-3">
<h3 id="org8b0df2d">Portuguese</h3>
<div class="outline-text-3" id="text-org8b0df2d">
<p>
Native or bilingual proficiency
</p>
</div>
</div>
<div id="outline-container-org84b46f6" class="outline-3">
<h3 id="org84b46f6">Spanish</h3>
<div class="outline-text-3" id="text-org84b46f6">
<p>
Limited working proficiency
</p>
</div>
</div>
</div>

<div id="outline-container-org09b442c" class="outline-2">
<h2 id="org09b442c">▐ Skills</h2>
<div class="outline-text-2" id="text-org09b442c">
</div>
<ul class="org-ul">
<li><a id="orgca4cfcd"></a>▐ Programming Languages<br>
<div class="outline-text-5" id="text-orgca4cfcd">
<pre class="example">
- C / Cpp
- Go
- R
- Lisp
- Common Lisp
- Elisp
- ShellScript
- Sh
- Bash
- Fish
- Octave
- Python
- Perl
- Lua
- Vhdl
- Sql
</pre>
</div>
</li>

<li><a id="org0b79476"></a>▐ Tools &amp; Tecnologies<br>
<div class="outline-text-5" id="text-org0b79476">
<pre class="example">
- Emacs
- FreeBSD
- Vm-bhyve
- Linux
- NFS
- Git
- Fish
- Jails
- Docker
- Docker Compose
- Prometheus
- Pushgateway
- Grafana
- OpenOCD
- Make
- CMake
- SQLite3
- Octave
- Gcc
- Gdb
- Clang
- Ldb
- Radare2
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge1d3496" class="outline-2">
<h2 id="orge1d3496">▐ Others Interests</h2>
<div class="outline-text-2" id="text-orge1d3496">
<p>
Literature, History, Mathematics, Finance,
Traveling, Trekking, Nutrition, Agriculture,
DIY, etc&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <ul>
    <li>
      Last updated: 2020-01-14 Tue 16:30+5:30.
    </li>
  </ul>
</div>
</div>
</body>
</html>
